---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         ---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 75.1%
Date: 1/5/2020
Time: 16:10
---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.4%
Date: 1/5/2020
Time: 16:32------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 80 epochs it achieved an accuracy of 76.3%
Date: 2/5/2020
Time: 1:30

_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 75.1%
Date: 1/5/2020
Time: 16:10
---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.4%
Date: 1/5/2020
Time: 16:32
