Ordered oldest to newest.

---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 75.1%
Date: 1/5/2020
Time: 16:10
---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.4%
Date: 1/5/2020
Time: 16:32------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 80 epochs it achieved an accuracy of 76.3%
Date: 2/5/2020
Time: 1:30
------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,387,364
Trainable params: 45,386,596
Non-trainable params: 768
_________________________________________________________________
Running on 80 epochs it achieved an accuracy of 74.4%
using 0 images------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       295040    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 128)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 401408)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               51380352  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 51,726,564
Trainable params: 51,726,308
Non-trainable params: 256
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 71.9%
using 0 imagesDate: 6/5/2020
Time: 2:31
---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,370,852
Trainable params: 45,370,084
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.7%
Date: 8/5/2020
Time: 13:57---------------------------------------------------------------

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 54, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 52, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 52, 52, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 52, 52, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               44302464  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 132       
=================================================================
Total params: 45,370,852
Trainable params: 45,370,084
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 77.8%
Date: 8/5/2020
Time: 14:27------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       295040    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 128)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 128)       512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 27, 128)       147584    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 64)        73792     
_________________________________________________________________
dropout_2 (Dropout)          (None, 25, 25, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 40000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                2560064   
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_4 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 132       
=================================================================
Total params: 3,091,844
Trainable params: 3,091,460
Non-trainable params: 384
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.8%
using 2272 imagesDate: 9/5/2020
Time: 2:0
------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 27, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 80000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               10240128  
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_4 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 132       
=================================================================
Total params: 11,293,060
Trainable params: 11,292,292
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 74.9%
using 2272 imagesDate: 9/5/2020
Time: 15:16
------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 27, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 80000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               10240128  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 11,325,028
Trainable params: 11,324,260
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 76.2%
using 2272 imagesDate: 9/5/2020
Time: 15:46
------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 27, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 80000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               10240128  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 11,325,028
Trainable params: 11,324,260
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 80.4%
using 1554 imagesDate: 9/5/2020
Time: 18:17
------------------------------------------------------------------------------------------------------------
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_1 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 27, 27, 128)       295040    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_2 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
flatten_1 (Flatten)          (None, 80000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               10240128  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_5 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 132       
=================================================================
Total params: 11,325,028
Trainable params: 11,324,260
Non-trainable params: 768
_________________________________________________________________
Running on 40 epochs it achieved an accuracy of 80.9%
This model is NOT using data augmentation
using 2054 imagesDate: 10/5/2020
Time: 6:32
------------------------------------------------------------------------------------------------------------
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 113, 113, 256)     7168      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 56, 256)       590080    
_________________________________________________________________
dropout_4 (Dropout)          (None, 56, 56, 256)       0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 56, 56, 256)       1024      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 27, 27, 128)       295040    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_5 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 25, 25, 128)       512       
_________________________________________________________________
flatten_2 (Flatten)          (None, 80000)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               10240128  
_________________________________________________________________
dense_8 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_6 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_10 (Dense)             (None, 32)                2080      
_________________________________________________________________
dense_11 (Dense)             (None, 4)                 132       
=================================================================
Total params: 11,308,516
Trainable params: 11,307,748
Non-trainable params: 768
_________________________________________________________________
Running on 80 epochs it achieved an accuracy of 85.4%
This model is NOT using data augmentation
using 2054 imagesDate: 11/5/2020
Time: 19:34

